NP

In [19]:
import numpy as np

In [33]:
df=np.array([[1,6],
            [2,8],
            [3,11],
            [3,10],
            [1,7]])

In [29]:
df.shape

(5, 2)

In [93]:
mean_a=np.mean(df[0:,0]),np.mean(df[0:,1])
print(mean_a)

(2.0, 8.4)

In [98]:
a_centered=df-mean_a # очень длинные формулировка задания я дольше понимал че делать надо, надеюсь что понял)

In [111]:
a_centered_sp= np.dot(a_centered[0:,0],a_centered[0:,1])/(df.shape[0]-1)
print(a_centered_sp)

2.0

In [115]:
np.cov(df.T)

array([[1. , 2. ],
       [2. , 4.3]])

PD

In [116]:
import pandas as pd

In [132]:
au={'author_id':[1,2,3],'author_name':['Тургенев', 'Чехов', 'Островский']}
autors=pd.DataFrame(au)

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [133]:
b={'author_id':[1, 1, 1, 2, 2, 3, 3],
'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
'price':[450, 300, 350, 500, 450, 370, 290]}
book=pd.DataFrame(b)

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [153]:
authors_price=autors.merge(book)
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [158]:
top5 = authors_price.sort_values(by=['price'],ascending=False).head()

In [184]:
authors_stat=authors_price.groupby('author_name').describe()['price']
authors_stat

             count        mean        std    min    25%    50%    75%    max
author_name
Островский     2.0  330.000000  56.568542  290.0  310.0  330.0  350.0  370.0
Тургенев       3.0  366.666667  76.376262  300.0  325.0  350.0  400.0  450.0
Чехов          2.0  475.000000  35.355339  450.0  462.5  475.0  487.5  500.0

In [203]:
c=['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price['cover']=c
authors_price
pd.pivot_table(authors_price,columns='cover',index='author_name',fill_value=0)['price']

cover        мягкая  твердая
author_name
Островский      330        0
Тургенев        325      450
Чехов             0      475